Elecrow-RD/CrowPanel-2.4-ESP32-HMI-320x240/example/V2.1/ESP_IDF/sdkconfig.defaults
# ESP-IDF 5.5.4 defaults for CrowPanel ESP32 2.4

CONFIG_IDF_TARGET="esp32"

# Arduino requires 1000 Hz tick rate
CONFIG_FREERTOS_HZ=1000

# Arduino as ESP-IDF component
CONFIG_ENABLE_ARDUINO_DEPENDS=y
CONFIG_ARDUINO_VARIANT="esp32"
# CONFIG_AUTOSTART_ARDUINO is not set

# Use User_Setup.h pin definitions instead of menuconfig defaults
# CONFIG_TFT_eSPI_ESPIDF is not set

# LVGL uses lv_conf.h in components/lvgl-3/
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# The application does not use LVGL's bundled examples or demos.
# CONFIG_LV_BUILD_EXAMPLES is not set
